In [72]:
import pandas as pd
import seaborn as sns
import numpy as np

In [73]:
df_iris = sns.load_dataset('iris')
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [74]:
df_iris.shape

(150, 5)

In [75]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [76]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [77]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [78]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [79]:
df_google.shape

(891, 12)

In [80]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [81]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [82]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [83]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [84]:
df_excel = pd.read_excel('train.xlsx')
df_excel.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S

In [85]:
df_excel_sample = df_excel.head(100)

In [86]:
df_excel_sample.shape

(100, 12)

In [87]:
df_excel.shape

(891, 12)

In [88]:
df_excel.columns[range(0,5)]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [89]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    float64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    float64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    float64
 7   Parch        891 non-null    float64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(7), object(5)
memory usage: 83.7+ KB

In [90]:
list(df_excel.select_dtypes(['object']).columns)

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [91]:
df2 = df_excel[df_excel.select_dtypes(['float64']).columns]
df2

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1.0       0.0     3.0  22.0    1.0    0.0   7.2500
1            2.0       1.0     1.0  38.0    1.0    0.0  71.2833
2            3.0       1.0     3.0  26.0    0.0    0.0   7.9250
3            4.0       1.0     1.0  35.0    1.0    0.0  53.1000
4            5.0       0.0     3.0  35.0    0.0    0.0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886        887.0       0.0     2.0  27.0    0.0    0.0  13.0000
887        888.0       1.0     1.0  19.0    0.0    0.0  30.0000
888        889.0       0.0     3.0   NaN    1.0    2.0  23.4500
889        890.0       1.0     1.0  26.0    0.0    0.0  30.0000
890        891.0       0.0     3.0  32.0    0.0    0.0   7.7500

[891 rows x 7 columns]

In [1]:
import acquire

In [2]:
df = acquire.get_titanic_data()
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [3]:
df = acquire.get_iris_data()
df

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [4]:
df = acquire.get_telco_data()
df

,customer_id,internet_service_type_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id,monthly_charges,total_charges,contract_type_id,paperless_billing
0,0002-ORFBO,1,DSL,Female,0,Yes,Yes,9,Yes,No,...,Yes,2,65.60,593.3,No,2,65.60,593.3,2,Yes
1,0003-MKNFE,1,DSL,Male,0,No,No,9,Yes,Yes,...,No,2,59.90,542.4,No,2,59.90,542.4,1,No
2,0004-TLHLJ,2,Fiber optic,Male,0,No,No,4,Yes,No,...,Yes,1,73.90,280.85,Yes,1,73.90,280.85,1,Yes
3,0011-IGKFF,2,Fiber optic,Male,1,Yes,No,13,Yes,No,...,Yes,1,98.00,1237.85,Yes,1,98.00,1237.85,1,Yes
4,0013-EXCHZ,2,Fiber optic,Female,1,Yes,No,3,Yes,No,...,Yes,2,83.90,267.4,Yes,2,83.90,267.4,1,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9282-IZGQK,2,Fiber optic,Female,0,No,No,1,Yes,Yes,...,Yes,1,85.00,85,Yes,1,85.00,85,1,Yes
7039,9462-MJUAW,1,DSL,Male,0,No,No,4,Yes,Yes,...,No,2,50.40,206.6,Yes,2,50.40,206.6,1,No
7040,9705-ZJBCG,1,DSL,Female,0,Yes,Yes,13,Yes,No,...,No,3,54.15,701.05,No,3,54.15,701.05,2,No
7041,9777-IQHWP,2,Fiber optic,Male,0,Yes,Yes,64,Yes,Yes,...,No,3,93.40,5822.3,No,3,93.40,5822.3,3,No
7042,9809-IMGCQ,2,Fiber optic,Male,1,No,No,22,Yes,Yes,...,Yes,1,96.70,2082.95,Yes,1,96.70,2082.95,1,Yes

In [6]:
df = acquire.new_titanic_data()
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [7]:
df = acquire.new_iris_data()
df

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [8]:
df = acquire.new_telco_data()
df.head(5)

,customer_id,internet_service_type_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id,monthly_charges,total_charges,contract_type_id,paperless_billing
0,0002-ORFBO,1,DSL,Female,0,Yes,Yes,9,Yes,No,...,Yes,2,65.6,593.3,No,2,65.6,593.3,2,Yes
1,0003-MKNFE,1,DSL,Male,0,No,No,9,Yes,Yes,...,No,2,59.9,542.4,No,2,59.9,542.4,1,No
2,0004-TLHLJ,2,Fiber optic,Male,0,No,No,4,Yes,No,...,Yes,1,73.9,280.85,Yes,1,73.9,280.85,1,Yes
3,0011-IGKFF,2,Fiber optic,Male,1,Yes,No,13,Yes,No,...,Yes,1,98.0,1237.85,Yes,1,98.0,1237.85,1,Yes
4,0013-EXCHZ,2,Fiber optic,Female,1,Yes,No,3,Yes,No,...,Yes,2,83.9,267.4,Yes,2,83.9,267.4,1,Yes